#+OPTIONS: H:2 ':t *:t
#+OPTIONS: org-confirm-babel-evaluate:nil
#+TITLE: Transforming 2010 Nebraska General Election Results
#+AUTHOR: Steven R. Dunbar
#+EMAIL: sdunbarne@gmail.edu

**** Burt County
| County | Fortenberry | Harper |
|--------+-------------+--------|
|        | REP         | DEM    |
| Burt   | 1854        | 679    |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Burt" & office=="Representative"), candidate), totals = sum(votes))
#+END_SRC

#+RESULTS:
| Ivy Harper       |  679 |
| Jeff Fortenberry | 1854 |

**** Totals
| Totals | Fortenberry | Harper |
|--------+-------------+--------|
|        | REP         | DEM    |
|        | 116,871     | 47106  |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, district=="1" & office=="Representative"), candidate), totals = sum(votes))
#+END_SRC

#+RESULTS:
| Ivy Harper       |  47106 |
| Jeff Fortenberry | 116871 |

**** Sarpy County
| County | Terry | White |
|--------+-------+-------|
|        | REP   | DEM   |
| Sarpy  | 20456 | 9354  |

Total  93840   60486
#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Sarpy" & office=="Representative"), candidate), totals = sum(votes))
#+END_SRC

#+RESULTS:
| Ivy Harper       |  1697 |
| Jeff Fortenberry |  6776 |
| Lee Terry        | 20456 |
| Tom White        |  9354 |

**** Totals

| Totals | Terry | White |
|--------+-------+-------|
|        | REP   | DEM   |
|        | 93840 | 68486 |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, district=="2" & office=="Representative"), candidate), totals = sum(votes))
#+END_SRC

#+RESULTS:
| Lee Terry | 93840 |
| Tom White | 60486 |

**** York County
| County | Smith | Davis | Hill     |
|--------+-------+-------+----------|
|        | REP   | DEM   | Petition |
| York   | 3217  | 538   | 277      |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="York" & office=="Representative"), candidate), totals = sum(votes))
#+END_SRC

#+RESULTS:
| Adrian Smith  | 3217 |
| Dan Hill      |  277 |
| Rebekah Davis |  538 |

**** Furnas County
| County | Smith | Davis | Hill     |
|--------+-------+-------+----------|
|        | REP   | DEM   | Petition |
| Furnas | 1439  | 263   | 138      |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Furnas" & office=="Representative"), candidate), totals = sum(votes))
#+END_SRC

#+RESULTS:
| Adrian Smith  | 1428 |
| Dan Hill      |  138 |
| Rebekah Davis |  262 |

**** Totals

| Totals | Terry  | White | Hill     |
|--------+--------+-------+----------|
|        | REP    | DEM   | Petition |
|        | 117275 | 29932 | 20036    |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, district=="3" & office=="Representative"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Adrian Smith  | 117264 |
| Dan Hill      |  20036 |
| Rebekah Davis |  29931 |

**** Furnas County
| County | Heineman | Meister |
|--------+----------+---------|
|        | REP      | DEM     |
| Furnas | 1546     | 300     |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Furnas" & office=="Governor"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Dave Heineman, Governor | 1535 |
| Mike Meister, Governor  |  299 |


**** Totals

| County | Heineman | Meister |
|--------+----------+---------|
|        | REP      | DEM     |
| Totals | 360,645  | 127343  |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, office=="Governor"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Dave Heineman, Governor | 360634 |
| Mike Meister, Governor  | 127342 |

**** Furnas County
| County | Heineman | Meister |
|--------+----------+---------|
|        | REP      | DEM     |
| Furnas | 1482     | 285     |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Furnas" & office=="Secretary of State"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Janet Stewart |  284 |
| John A. Gale  | 1472 |

**** Totals

| County | Gale   | Stewart |
|--------+--------+---------|
|        | REP    | DEM     |
| Totals | 326431 | 141564  |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, office=="Secretary of State"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Janet Stewart | 141563 |
| John A. Gale  | 326421 |

**** Furnas County
| County | Bruning |
|--------+---------|
|        | REP     |
| Furnas | 1664    |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Furnas" & office=="Attorney General"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Jon Bruning | 1652 |

**** Totals

| County | Bruning |
|--------+---------|
|        | REP     |
| Totals | 393124  |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, office=="Attorney General"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Jon Bruning | 393115 |

**** Furnas County
| County | Stenberg | Stoj |
|--------+----------+------|
|        | REP      | DEM  |
| Furnas | 1529     | 266  |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Furnas" & office=="State Treasurer"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Don Stenberg | 1518 |
| Mark Stoj    |  265 |

**** Totals

| County | Stenberg | Stoj   |
|--------+----------+--------|
|        | REP      | DEM    |
| Totals | 345661   | 128231 |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, office=="State Treasurer"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Don Stenberg | 345650 |
| Mark Stoj    | 128230 |

**** Furnas County
| County | Foley | Sallach-Grace |
|--------+-------+---------------|
|        | REP   | DEM           |
| Furnas | 1461  | 205           |

#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, county=="Furnas" & office=="Auditor"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Michele Sallach-Grace |  205 |
| Mike Foley            | 1449 |

**** Totals

| County | Foley  | Sallach-Grace |
|--------+--------+---------------|
|        | REP    | DEM           |
| Totals | 345436 | 88433         |


#+BEGIN_SRC R :session *R*
summarize( group_by( filter(ne2010, office=="Auditor"), candidate), totals = sum(votes, na.rm=TRUE))
#+END_SRC

#+RESULTS:
| Michele Sallach-Grace |  88433 |
| Mike Foley            | 345424 |

**** Sarpy County

| County | Smith | Whitehead |
|--------+-------+-----------|
|        | REP   | DEM       |
| Totals | 6203  | 4995      |

#+BEGIN_SRC R :session *R*
 summarize( group_by( filter(ne2010, county=="Sarpy", legdist=="14"), candidate), totals = sum(votes))
#+END_SRC

#+RESULTS:
| Jim Smith        | 6203 |
| Teresa Whitehead | 4995 |

